<a href="https://colab.research.google.com/github/kang-narae/AI-DL-DA/blob/main/%EB%8D%B0%EC%9D%B4%ED%84%B0%EC%A0%84%EC%B2%98%EB%A6%AC/df%EC%97%B0%EC%82%B0_%EA%B7%B8%EB%A3%B9%ED%95%91.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# 컬럼값에 apply로 함수 적용

In [ ]:
import pandas as pd
import seaborn as sns

In [ ]:
titanic =  sns.load_dataset('titanic')
df= titanic.loc[:, ['age','fare']]     #dataset doth  age, fare 컬럼만 가져온 df 객체 만들고
df['ten'] = 10    #ten이라는 컬럼 추가함

print(df.head())

    age     fare  ten
0  22.0   7.2500   10
1  38.0  71.2833   10
2  26.0   7.9250   10
3  35.0  53.1000   10
4  35.0   8.0500   10

In [ ]:
def add_5(n):
  return n+5

In [ ]:
for i in range(len(df)):
  df.iloc[i,0] = add_5(df.iloc[i,0])             #age행의 각 값에 함수를 적용한다.
print(df.age)

0      27.0
1      43.0
2      31.0
3      40.0
4      40.0
       ...
886    32.0
887    24.0
888     NaN
889    31.0
890    37.0
Name: age, Length: 891, dtype: float64

In [ ]:
#포문 쓰지 않고 apply함수 적용해서 값 처리 하는 법.



sr1= df['age'].apply(add_5)
print(sr1)

0      32.0
1      48.0
2      36.0
3      45.0
4      45.0
       ...
886    37.0
887    29.0
888     NaN
889    36.0
890    42.0
Name: age, Length: 891, dtype: float64

In [ ]:
sr1= df['age'].apply(lambda x: x*3 -4)
print(sr1)

0       77.0
1      125.0
2       89.0
3      116.0
4      116.0
       ...
886     92.0
887     68.0
888      NaN
889     89.0
890    107.0
Name: age, Length: 891, dtype: float64

# concat으로 두 데이터프레임 합치기

In [ ]:
df1= pd.DataFrame({'a':['a0','a1','a2','a3'],
                   'b':['b0','b1','b2','b3'],
                   'c':['c0','c1','c2','c3']
                   },
                   index=[0,1,2,3]
                   )
print(df1)

    a   b   c
0  a0  b0  c0
1  a1  b1  c1
2  a2  b2  c2
3  a3  b3  c3

In [ ]:
df2= pd.DataFrame({'a':['a2','a3','a4','a5'],
                   'b':['b2','b3','b4','b5'],
                   'c':['c2','c3','c4','c5'],
                   'd':['d2','d3','d4','d5']},
                   index=[2,3,4,5]
                   )
print(df2)

    a   b   c   d
2  a2  b2  c2  d2
3  a3  b3  c3  d3
4  a4  b4  c4  d4
5  a5  b5  c5  d5

In [ ]:
result1 = pd.concat([df1, df2])   #컨캣할때 없는값은 nan으로 채워줌. 중복은 그대로 중복적으로 나옴.
result1.reset_index(drop=True,  inplace=True)   #원래인덱스 빼고, 새로운 인덱스로 채움
print(result1)

    a   b   c    d
0  a0  b0  c0  NaN
1  a1  b1  c1  NaN
2  a2  b2  c2  NaN
3  a3  b3  c3  NaN
4  a2  b2  c2   d2
5  a3  b3  c3   d3
6  a4  b4  c4   d4
7  a5  b5  c5   d5

In [ ]:
result2= pd.concat([df1, df2], ignore_index=True)       #원래의 인덱스를 무시하고 새롭게 인덱스를 순서대로 붙여줌.
print(result2)

    a   b   c    d
0  a0  b0  c0  NaN
1  a1  b1  c1  NaN
2  a2  b2  c2  NaN
3  a3  b3  c3  NaN
4  a2  b2  c2   d2
5  a3  b3  c3   d3
6  a4  b4  c4   d4
7  a5  b5  c5   d5

In [ ]:
result3= pd.concat([df1, df2], axis='columns')            #열기준으로 오른쪽으로 이어붙임
print(result3)

     a    b    c    a    b    c    d
0   a0   b0   c0  NaN  NaN  NaN  NaN
1   a1   b1   c1  NaN  NaN  NaN  NaN
2   a2   b2   c2   a2   b2   c2   d2
3   a3   b3   c3   a3   b3   c3   d3
4  NaN  NaN  NaN   a4   b4   c4   d4
5  NaN  NaN  NaN   a5   b5   c5   d5

In [ ]:
result4= pd.concat([df1, df2], axis=1 , join= 'inner')     #공통된 부분만. 교집합
print(result4)

    a   b   c   a   b   c   d
2  a2  b2  c2  a2  b2  c2  d2
3  a3  b3  c3  a3  b3  c3  d3

In [ ]:
result5= pd.concat([df1, df2], axis=0, join= 'inner')     #공통된 부분만. 교집합
print(result5)

    a   b   c
0  a0  b0  c0
1  a1  b1  c1
2  a2  b2  c2
3  a3  b3  c3
2  a2  b2  c2
3  a3  b3  c3
4  a4  b4  c4
5  a5  b5  c5

In [ ]:
result5= pd.concat([df1, df2], axis=0)    #기본적으로 outer로 나옴.
print(result5)

    a   b   c    d
0  a0  b0  c0  NaN
1  a1  b1  c1  NaN
2  a2  b2  c2  NaN
3  a3  b3  c3  NaN
2  a2  b2  c2   d2
3  a3  b3  c3   d3
4  a4  b4  c4   d4
5  a5  b5  c5   d5

## 타이타닉 예제

In [ ]:
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [ ]:
df= titanic.loc[: , ['age','sex','class','fare','survived']]   #titanic df중 전체 행, 일부 컬럼 불러옴
print(len(df))
print(df.head())

891
    age     sex  class     fare  survived
0  22.0    male  Third   7.2500         0
1  38.0  female  First  71.2833         1
2  26.0  female  Third   7.9250         1
3  35.0  female  First  53.1000         1
4  35.0    male  Third   8.0500         0

In [ ]:
df['class'].unique()      #특정 컬럼의 중복제거하고 유니크한 값과 개수 찾기
print(df['class'].value_counts())

Third     491
First     216
Second    184
Name: class, dtype: int64

# 특정컬럼의 유니크값 기준으로 그룹핑한 객체 만들기

In [ ]:
grouped= df.groupby(['class'])       #클래스 컬럼의 값 기준으로 그룹핑
print(grouped)

In [ ]:
grouped_df= {}
for key,group in grouped:
  print('key:', key)
  print('length:', len(group))
  grouped_df[key] = group   #빈딕셔너리에 추가함. 근데 왜 빈딕셔너리에 추가해야 하는 거지?
  print(group.head())

key: First
length: 216
     age     sex  class     fare  survived
1   38.0  female  First  71.2833         1
3   35.0  female  First  53.1000         1
6   54.0    male  First  51.8625         0
11  58.0  female  First  26.5500         1
23  28.0    male  First  35.5000         1
key: Second
length: 184
     age     sex   class     fare  survived
9   14.0  female  Second  30.0708         1
15  55.0  female  Second  16.0000         1
17   NaN    male  Second  13.0000         1
20  35.0    male  Second  26.0000         0
21  34.0    male  Second  13.0000         1
key: Third
length: 491
    age     sex  class     fare  survived
0  22.0    male  Third   7.2500         0
2  26.0  female  Third   7.9250         1
4  35.0    male  Third   8.0500         0
5   NaN    male  Third   8.4583         0
7   2.0    male  Third  21.0750         0

In [ ]:
average= grouped.mean()   #그룹핑된 객체의 평균을 구하면

In [ ]:
print(average)                #클래스별로 그룹핑된 그룹별로, 숫자로 된 - 계산가능한 - 컬럼들을 계산해줌. 
# groupby 객체여서 가능한 거. 그룹별로 각각그이 평균을 구하거나, 표준편차를 구하거나 .  . . ..

              age       fare  survived
class
First   38.233441  84.154687  0.629630
Second  29.877630  20.662183  0.472826
Third   25.140620  13.675550  0.242363

# 두가지 이상의 컬럼을 기준으로 그룹핑

In [ ]:
grouped_two = df.groupby(['class','sex'])       #두개의 컬럼을 기준으로 그룹핑하면

for key, group in grouped_two:           #각각의 키와 그룹이 생긴다
  print('key는', key)
  print('length는', len(group))
  print('group은')
  print(group.head())

key는 ('First', 'female')
length는 94
group은
     age     sex  class      fare  survived
1   38.0  female  First   71.2833         1
3   35.0  female  First   53.1000         1
11  58.0  female  First   26.5500         1
31   NaN  female  First  146.5208         1
52  49.0  female  First   76.7292         1
key는 ('First', 'male')
length는 122
group은
     age   sex  class      fare  survived
6   54.0  male  First   51.8625         0
23  28.0  male  First   35.5000         1
27  19.0  male  First  263.0000         0
30  40.0  male  First   27.7208         0
34  28.0  male  First   82.1708         0
key는 ('Second', 'female')
length는 76
group은
     age     sex   class     fare  survived
9   14.0  female  Second  30.0708         1
15  55.0  female  Second  16.0000         1
41  27.0  female  Second  21.0000         0
43   3.0  female  Second  41.5792         1
53  29.0  female  Second  26.0000         1
key는 ('Second', 'male')
length는 108
group은
     age   sex   class  fare  survived
17   NaN  male  Second  13.0         1
20  35.0  male  Second  26.0         0
21  34.0  male  Second  13.0         1
33  66.0  male  Second  10.5         0
70  32.0  male  Second  10.5         0
key는 ('Third', 'female')
length는 144
group은
     age     sex  class     fare  survived
2   26.0  female  Third   7.9250         1
8   27.0  female  Third  11.1333         1
10   4.0  female  Third  16.7000         1
14  14.0  female  Third   7.8542         0
18  31.0  female  Third  18.0000         0
key는 ('Third', 'male')
length는 347
group은
     age   sex  class     fare  survived
0   22.0  male  Third   7.2500         0
4   35.0  male  Third   8.0500         0
5    NaN  male  Third   8.4583         0
7    2.0  male  Third  21.0750         0
12  20.0  male  Third   8.0500         0

In [ ]:
print(grouped_two.mean())      #두개의 컬럼으로 그룹핑된 각각의 그룹에서, 계산 가능한 컬럼마다 mean 계산하기.

                     age        fare  survived
class  sex
First  female  34.611765  106.125798  0.968085
       male    41.281386   67.226127  0.368852
Second female  28.722973   21.970121  0.921053
       male    30.740707   19.741782  0.157407
Third  female  21.750000   16.118810  0.500000
       male    26.507589   12.661633  0.135447

In [ ]:
group3f = grouped_two.get_group(('Third', 'female'))         #그룹핑된 그룹 중  get_group 사용으로 특정 그룹을 찾아내기.
print(group3f)

      age     sex  class     fare  survived
2    26.0  female  Third   7.9250         1
8    27.0  female  Third  11.1333         1
10    4.0  female  Third  16.7000         1
14   14.0  female  Third   7.8542         0
18   31.0  female  Third  18.0000         0
..    ...     ...    ...      ...       ...
863   NaN  female  Third  69.5500         0
875  15.0  female  Third   7.2250         1
882  22.0  female  Third  10.5167         0
885  39.0  female  Third  29.1250         0
888   NaN  female  Third  23.4500         0

[144 rows x 5 columns]

In [ ]:
dfg= grouped_two.mean()
print(dfg)

                     age        fare  survived
class  sex
First  female  34.611765  106.125798  0.968085
       male    41.281386   67.226127  0.368852
Second female  28.722973   21.970121  0.921053
       male    30.740707   19.741782  0.157407
Third  female  21.750000   16.118810  0.500000
       male    26.507589   12.661633  0.135447

In [ ]:
print(dfg.loc[('First','male')])             #그룹핑된 df에서 loc 이용해서 튜플로 위치 찾을 수 있음.

age         41.281386
fare        67.226127
survived     0.368852
Name: (First, male), dtype: float64

In [ ]:
print(dfg.loc['First'])

              age        fare  survived
sex
female  34.611765  106.125798  0.968085
male    41.281386   67.226127  0.368852

In [ ]:
print(dfg.xs('female', level='sex'))

              age        fare  survived
class
First   34.611765  106.125798  0.968085
Second  28.722973   21.970121  0.921053
Third   21.750000   16.118810  0.500000

# 피봇테이블

In [ ]:
pdf1= pd.pivot_table(df,                   
                     index='class',      #클래스 컬럼의 값을 기준으로 인덱싱하고
                     columns='sex',     #sex 컬럼의 값을 기준으로 열을 나눈다
                     values='age',      #내부에는 age값을
                     aggfunc='mean'        #mean 집계함수를 이용한다.
                     )
print(pdf1)
print(type(pdf1))             #피봇테이블은 데이터프레임 타입이다

sex        female       male
class
First   34.611765  41.281386
Second  28.722973  30.740707
Third   21.750000  26.507589
<class 'pandas.core.frame.DataFrame'>

In [ ]:
pdf2= pd.pivot_table(df,                   
                     index='class',
                     columns='sex',
                     values=['age','fare'],    #두개의 계산가능한 컬럼에 대한
                     aggfunc='mean'           #집계함수
                     )
print(pdf2)
print(type(pdf2))

              age                   fare
sex        female       male      female       male
class
First   34.611765  41.281386  106.125798  67.226127
Second  28.722973  30.740707   21.970121  19.741782
Third   21.750000  26.507589   16.118810  12.661633
<class 'pandas.core.frame.DataFrame'>

In [ ]:
pdf3= pd.pivot_table(df,                   
                     index='class',
                     columns='sex',
                     values='age',
                     aggfunc=['mean', 'sum', 'std']
                     )
print(pdf3)
print(type(pdf3))

             mean                sum                 std
sex        female       male  female     male     female       male
class
First   34.611765  41.281386  2942.0  4169.42  13.612052  15.139570
Second  28.722973  30.740707  2125.5  3043.33  12.872702  14.793894
Third   21.750000  26.507589  2218.5  6706.42  12.729964  12.159514
<class 'pandas.core.frame.DataFrame'>

In [ ]:
pdf4= pd.pivot_table(df,                   
                     index=['class', 'sex'],
                     columns='survived',
                     values=['age','fare'],
                     aggfunc=['mean', 'max']
                     )
print(pdf4)
print(type(pdf4))

                    mean                                      max        \
                     age                   fare               age
survived               0          1           0           1     0     1
class  sex
First  female  25.666667  34.939024  110.604167  105.978159  50.0  63.0
       male    44.581967  36.248000   62.894910   74.637320  71.0  80.0
Second female  36.000000  28.080882   18.250000   22.288989  57.0  55.0
       male    33.369048  16.022000   19.488965   21.095100  70.0  62.0
Third  female  23.818182  19.329787   19.773093   12.464526  48.0  63.0
       male    27.255814  22.274211   12.204469   15.579696  74.0  45.0


                 fare
survived            0         1
class  sex
First  female  151.55  512.3292
       male    263.00  512.3292
Second female   26.00   65.0000
       male     73.50   39.0000
Third  female   69.55   31.3875
       male     69.55   56.4958
<class 'pandas.core.frame.DataFrame'>

In [ ]:
print(pdf4.index)
print(pdf4.columns)

MultiIndex([( 'First', 'female'),
            ( 'First',   'male'),
            ('Second', 'female'),
            ('Second',   'male'),
            ( 'Third', 'female'),
            ( 'Third',   'male')],
           names=['class', 'sex'])
MultiIndex([('mean',  'age', 0),
            ('mean',  'age', 1),
            ('mean', 'fare', 0),
            ('mean', 'fare', 1),
            ( 'max',  'age', 0),
            ( 'max',  'age', 1),
            ( 'max', 'fare', 0),
            ( 'max', 'fare', 1)],
           names=[None, None, 'survived'])

In [ ]:
print(pdf4.xs('First'))

               mean                                      max                \
                age                   fare               age          fare
survived          0          1           0           1     0     1       0
sex
female    25.666667  34.939024  110.604167  105.978159  50.0  63.0  151.55
male      44.581967  36.248000   62.894910   74.637320  71.0  80.0  263.00



survived         1
sex
female    512.3292
male      512.3292